Catalogs/Кошельки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Кошельки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКошелька</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКошельков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКредита</Name>
					<Comment>если это кредит в банке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКредитПолученный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетОстатковБюджет</Name>
					<Comment>по этим кошелькам будут рассчитываться остатки для бюджета</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКошелька</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКошельков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитнаяКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Comment>процентная ставка по кредиту/депозиту</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Comment>дни, месяцы или годы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаСрока</Name>
					<Comment>0-дни, 1-месяцы,2-годы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Капитализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачОст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедельноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКредитГашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧестныйОвердрафт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрейсПериодВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаПополненияВДнях</Name>
					<Comment>за N дней до конца пополнение прекращается</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыКошельков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыКошельков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеДеньги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетДепо</Name>
					<Comment>депозитарный счет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кошельки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидКошелькаПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаСервере
Функция УправлениеВидимостьюСервер()
	
	РезультатСтруктура = Новый Структура;
	Если Объект.ВидКошелька = Перечисления.ВидыКошельков.Наличные Тогда
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Ложь);
		
	ИначеЕсли Объект.ВидКошелька = Перечисления.ВидыКошельков.БанковскийСчет Тогда
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Истина);

	ИначеЕсли Объект.ВидКошелька = Перечисления.ВидыКошельков.ЭлектронныеДеньги Тогда
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Ложь);

	Иначе
		РезультатСтруктура.Вставить("СтраницаБанкСчет", Ложь);

	КонецЕсли;
	
	Возврат РезультатСтруктура;
	
КонецФункции

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	
	ВидимостьСтруктура = УправлениеВидимостьюСервер();
	
	Элементы.СтраницаБанкСчет.Видимость = ВидимостьСтруктура.СтраницаБанкСчет;
	
	Элементы.СтатьяКредитПолученный.Видимость = Объект.КредитнаяКарта;
	Элементы.НадписьСтатьяКредитПолуч.Видимость = Объект.КредитнаяКарта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура КредитнаяКартаПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозПоДепозиту(Команда)
	ПрогнозПоДепозитуСервер();
КонецПроцедуры

&НаСервере
Процедура ПрогнозПоДепозитуСервер()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Ставка", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("НачОст", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ПроцентыЗаДень", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ПроцентыВсего", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("КонОст", Новый ОписаниеТипов("Число"));
	
    СрокДепо = Объект.Срок;
	Коэффициент = 1;
	Если Объект.ЕдиницаСрока = 0 Тогда
		Коэффициент = 1 / 365 / 100;
	ИначеЕсли Объект.ЕдиницаСрока = 1 Тогда
		//месяцы
		Коэффициент = 1 / 12 / 100;
	ИначеЕсли Объект.ЕдиницаСрока = 2 Тогда
		//годы
		Коэффициент = 1 / 100;
	КонецЕсли;
	
	НовСтр = ТЗ.Добавить();
	НовСтр.Дата = Объект.ДатаОткрытия+86400;
	НовСтр.НачОст = Объект.НачОст;
	НовСтр.Ставка = Объект.Ставка * Коэффициент;
	НовСтр.ПроцентыЗаДень = НовСтр.НачОст*НовСтр.Ставка;
	НовСтр.ПроцентыВсего = НовСтр.ПроцентыВсего + НовСтр.ПроцентыЗаДень;
	НовСтр.КонОст = НовСтр.НачОст;
	
	Если КонецДня(НовСтр.Дата) = КонецМесяца(НовСтр.Дата) Тогда
		Если Объект.Капитализация Тогда
			НовСтр.КонОст = НовСтр.КонОст + НовСтр.ПроцентыВсего;
			НовСтр.ПроцентыВсего = 0;	
		КонецЕсли;
	КонецЕсли;

	
	Для сч = 1 По СрокДепо-1 Цикл
		НовСтр 					= ТЗ.Добавить();
		НовСтр.Дата				= ТЗ.Получить(сч-1)["Дата"]+86400;
		НовСтр.НачОст 			= ТЗ.Получить(сч-1)["КонОст"];
		НовСтр.Ставка 			= Объект.Ставка * Коэффициент;
		НовСтр.ПроцентыЗаДень 	= НовСтр.НачОст*НовСтр.Ставка;
		НовСтр.ПроцентыВсего 	= ТЗ.Получить(сч-1)["ПроцентыВсего"] + НовСтр.ПроцентыЗаДень;
		НовСтр.КонОст 			= НовСтр.НачОст;
		Если КонецДня(НовСтр.Дата) = КонецМесяца(НовСтр.Дата) Тогда
			Если Объект.Капитализация Тогда
				НовСтр.КонОст = НовСтр.КонОст + НовСтр.ПроцентыВсего;
				НовСтр.ПроцентыВсего = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТЗ.ВыбратьСтроку();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

КонецПроцедуры
